In [2]:
import pandas as pd

In [6]:
# Q.1

l = [4,8,15,16,23,42]
s = pd.Series(l)
print(s)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [7]:
# Q.2

l1 = [1,2,3,4,5,6,7,8,9,10]
s1 = pd.Series(l1)
print(s1)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [8]:
# Q.3

l2 = {'Name': ['Alice','Bob','Claire'],
      'Age': [25,30,27],
      'Gender': ['Female','Male','Female']}

s2 = pd.DataFrame(l2)

In [11]:
print(s2)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [12]:
# Q.4

'''In pandas data frame is a tabular or CSV which are 2D tabular data and contain multiple columns as series'''
'''Whereas series are the columns of that data frame'''
'''Data frame can be generated using lists or dictionary but series are lists'''
'''For example in above quesn. s2 is the data Frame that we had created from dict.(l2) and the columns inside them "Name","Age","Gender" are series.'''

'For example in above quesn. s2 is the data Frame that we had created from dict.(l2) and the columns inside them "Name","Age","Gender" are series.'

In [13]:
# Q.5

'''Some common functions you can use to manipulate data in a Pandas DataFrame are following
 1. read_csv, read_excel, to_excel
 2. describe, mean, max, min, median
 3. concat, dropna, fillna'''

# Examples

s2.describe()

             Age
count   3.000000
mean   27.333333
std     2.516611
min    25.000000
25%    26.000000
50%    27.000000
75%    28.500000
max    30.000000

In [ ]:
# Q.6

'''Seies & data frame are mutable as their details can be changed '''

In [14]:
# Q.7
 
l3 = {'Name': ['Anamika','Bittu','Kirti','Ajit','Deepa'],
      'Age': [25,30,27,29,35],
      'Gender': ['Female','Male','Female','Male','Female'],
      'Location': ['Agra','Faridabad','Varanasi','Delhi','Patna'],
      'Monthly_Income(in k)': [28,32,26,34,45]}

s3 = pd.DataFrame(l3)

In [15]:
s3

      Name  Age  Gender   Location  Monthly_Income(in k)
0  Anamika   25  Female       Agra                    28
1    Bittu   30    Male  Faridabad                    32
2    Kirti   27  Female   Varanasi                    26
3     Ajit   29    Male      Delhi                    34
4    Deepa   35  Female      Patna                    45

In [ ]:
'''Here I had created a data frame having differnt series as columns (Name,Age,Gender,Location,Monthly_income)'''